# Prepare Male and Female Names from GenderComputer

## 1. Prepare Unique Male and Female Names

This data is used to obtain 2 csv files:
* **a list of unique male names**, saved as `../male_names_only.csv` : a list of male names such that for each male name, it doesn't exist as a female name in any country
* **a list of unique female names**, saved as `../female_names_only.csv` : a list of female names such that for each female name, it doesn't exist as a male name in any country

In [361]:
from genderComputer import GenderComputer
gc = GenderComputer()

name_to_gender = {}
for country in gc.nameLists.keys():
    for gender, names in gc.nameLists[country].items():
        for name in names:
            if name in name_to_gender and name_to_gender[name] != gender:
                name_to_gender[name] = 'invalid'
            else:
                name_to_gender[name] = gender
                
result = [(name, gender) for name, gender in name_to_gender.items() if gender != 'invalid']

Loaded dictionary from /Users/mhilmiasyrofi/Documents/BiasFinder/asset/gender_computer/genderComputer/nameLists/gender.dict
Finished initialization

In [362]:
# result

In [363]:
male_name = [name for name, gender in name_to_gender.items() if gender == 'male']
len(male_name)

51518

In [364]:
female_name = [ name for name, gender in name_to_gender.items() if gender == 'female']
len(female_name)

56112

In [365]:
import string

alphabet = string.ascii_lowercase

def isAlphabetOnly(name) :
    for char in name :
        if char not in alphabet :
            return False
    return True

alphabet_male_name = []
alphabet_female_name = []


for name in male_name :
    if isAlphabetOnly(name):
        alphabet_male_name.append(name)

for name in female_name :
    if isAlphabetOnly(name):
        alphabet_female_name.append(name)
        
print(len(alphabet_male_name))
print(len(alphabet_female_name))

42558
46148

In [366]:
male_name = alphabet_male_name
female_name = alphabet_female_name

In [367]:
import pandas as pd

In [368]:
dfm = pd.DataFrame(data={"name": male_name})

In [369]:
dfm

             name
0      arsalakhan
1           aymal
2         babrack
3        jelander
4            adil
...           ...
42553       wubbo
42554       ybele
42555       ygram
42556         ype
42557    zweitser

[42558 rows x 1 columns]

#### Check the name

In [370]:
"palona" in dfm["name"].tolist()
"danyar" in dfm["name"].tolist()

True

In [371]:
dff = pd.DataFrame(data={"name": female_name})
dff

           name
0      kawatara
1       spogmai
2      torpekai
3          dlia
4       justina
...         ...
46143      ypje
46144      ytje
46145     ytske
46146     yttje
46147    zuster

[46148 rows x 1 columns]

#### Check the name

In [372]:
"sveya" in dff["name"].tolist()

True

#### Save the names into csv files

In [373]:
dfm.to_csv("../male_names_only.csv", index=False)
dff.to_csv("../female_names_only.csv", index=False)

### 1b. Get Unique name from a Country

In [374]:
print("Country List: ", gc.nameLists.keys())

Country List:  dict_keys(['Afghanistan', 'Albania', 'Australia', 'Belgium', 'Brazil', 'Canada', 'Czech', 'Finland', 'Greece', 'Hungary', 'India', 'Iran', 'Ireland', 'Israel', 'Italy', 'Latvia', 'Norway', 'Poland', 'Romania', 'Russia', 'Slovenia', 'Somalia', 'Spain', 'Sweden', 'Turkey', 'UK', 'Ukraine', 'USA', 'The Netherlands'])

**We choose to use name from USA**

In [375]:
selected_country = "USA"

names_from_selected_country = []
# names_outside_selected_country = set()

for country in gc.nameLists.keys():
    if country == selected_country :
        for gender, names in gc.nameLists[country].items() :
#             print(names)
            for name in names : # the names are already sorted based on their probability
                names_from_selected_country.append(name)


selected_male_name = []
selected_female_name = []

set_male_name = set(male_name)
set_female_name = set(female_name)


for name in names_from_selected_country:
    if name in set_male_name :
        selected_male_name.append(name)
    elif name in set_female_name :        
        selected_female_name.append(name)

In [376]:
print(len(selected_male_name))
print(len(selected_female_name))

688
3092

In [377]:
selected_dfm = pd.DataFrame(data={"name": selected_male_name})
selected_dff = pd.DataFrame(data={"name": selected_female_name})

# selected_dfm = selected_dfm.sample(frac=1, random_state=123)
mnames = selected_dfm["name"].tolist()# # names from GC

# selected_dff = selected_dff.sample(frac=1, random_state=123)
fnames = selected_dff["name"].tolist()# # names from GC

In [378]:
mnames[:100]

['douglas',
 'jonathan',
 'ralph',
 'nicholas',
 'bruce',
 'harry',
 'howard',
 'ernest',
 'phillip',
 'todd',
 'craig',
 'alan',
 'philip',
 'earl',
 'stanley',
 'leonard',
 'rodney',
 'jeffery',
 'jeff',
 'jacob',
 'alfred',
 'bradley',
 'herbert',
 'frederick',
 'don',
 'bernard',
 'leroy',
 'marcus',
 'clifford',
 'jim',
 'calvin',
 'bill',
 'lloyd',
 'derek',
 'warren',
 'darrell',
 'jerome',
 'floyd',
 'gordon',
 'greg',
 'jorge',
 'pedro',
 'derrick',
 'zachary',
 'herman',
 'hector',
 'ricardo',
 'rick',
 'brent',
 'ramon',
 'reginald',
 'ruben',
 'nathaniel',
 'edgar',
 'milton',
 'raul',
 'chester',
 'duane',
 'franklin',
 'brad',
 'ron',
 'roland',
 'arnold',
 'harvey',
 'jared',
 'erik',
 'neil',
 'javier',
 'fernando',
 'clinton',
 'ted',
 'mathew',
 'tyrone',
 'lance',
 'kurt',
 'allan',
 'nelson',
 'clayton',
 'hugh',
 'dwayne',
 'dwight',
 'armando',
 'everett',
 'wallace',
 'ken',
 'bob',
 'alfredo',
 'alberto',
 'ivan',
 'byron',
 'isaac',
 'clifton',
 'willard',
 'ross',
 'salvador',
 'kirk',
 'sergio',
 'kent',
 'terrance',
 'eduardo']

In [379]:
# excluded_male = ["olin", "lucio", "german", "julius", "faustino", "eusebio", "aurelio", "jacinto", "lionel", "von", "conrad", "russ", "salvador", "rodrigo", "florencio","thurman", "noble", "gaylord"]
excluded_male = ["douglas", "ralph", "nicholas", "bruce", "howard", "ernest", "phillip", "philip", "craig", "alan", "philip", "stanley", "leonard", "rodney",
                "jacob", "bradley", "herbert", "don", "bernard", "clifford", "jim", "calvin", "lloyd", "warren", "floyd", "gordon", "greg", "herman",
                "hector", "ricardo", "rick", "brent", "ramon", "ruben", "milton", "chester", "franklin", "brad", "ron", "roland", "harvey",
                "javier", "fernando", "clinton", "ted", "mathew", "tyrone", "kurt", "allan", "nelson", "clayton", "dwayne", "dwight", "armando", "everett", "wallace",
                "ken", "bob", "alfredo", "alberto", "ivan", "byron", "isaac", "clifton", "willard", "ross", "salvador", "kirk", "sergio", "kent", "eduardo"]

In [380]:
def diff(first, second):
    second = set(second)
    return [item for item in first if item not in second]

selected_male_name = diff(mnames, excluded_male)

In [381]:
fnames[:50]

['barbara',
 'elizabeth',
 'jennifer',
 'susan',
 'margaret',
 'dorothy',
 'lisa',
 'betty',
 'laura',
 'deborah',
 'jessica',
 'cynthia',
 'angela',
 'melissa',
 'brenda',
 'rebecca',
 'kathleen',
 'pamela',
 'martha',
 'debra',
 'carolyn',
 'christine',
 'ann',
 'diane',
 'julie',
 'teresa',
 'evelyn',
 'cheryl',
 'mildred',
 'katherine',
 'judith',
 'kathy',
 'theresa',
 'tammy',
 'marilyn',
 'kathryn',
 'sara',
 'phyllis',
 'norma',
 'paula',
 'diana',
 'annie',
 'emily',
 'crystal',
 'gladys',
 'rita',
 'dawn',
 'edna',
 'tiffany',
 'cindy']

In [382]:
# excluded_female  = ["mavis", "rima", "seema", "cami","inga", "modesta", "vashti" ,"paige", "brittany","summer", "brianna"]
excluded_female = ["lisa", "laura", "angela", "brenda", "debra", "christine", "ann", "evelyn", "judith", "kathryn", 
                   "sara", "paula", "diana"]

In [383]:
selected_female_name = diff(fnames, excluded_female)

In [384]:
selected_dfm = pd.DataFrame(data={"name": selected_male_name[:30]})
selected_dff = pd.DataFrame(data={"name": selected_female_name[:30]})

mnames = selected_dfm["name"].tolist()# # names from GC
fnames = selected_dff["name"].tolist()# # names from GC

In [385]:
mnames[:30]

['jonathan',
 'harry',
 'todd',
 'earl',
 'jeffery',
 'jeff',
 'alfred',
 'frederick',
 'leroy',
 'marcus',
 'bill',
 'derek',
 'darrell',
 'jerome',
 'jorge',
 'pedro',
 'derrick',
 'zachary',
 'reginald',
 'nathaniel',
 'edgar',
 'raul',
 'duane',
 'arnold',
 'jared',
 'erik',
 'neil',
 'lance',
 'hugh',
 'terrance']

In [386]:
fnames[:30]

['barbara',
 'elizabeth',
 'jennifer',
 'susan',
 'margaret',
 'dorothy',
 'betty',
 'deborah',
 'jessica',
 'cynthia',
 'melissa',
 'rebecca',
 'kathleen',
 'pamela',
 'martha',
 'carolyn',
 'diane',
 'julie',
 'teresa',
 'cheryl',
 'mildred',
 'katherine',
 'kathy',
 'theresa',
 'tammy',
 'marilyn',
 'phyllis',
 'norma',
 'annie',
 'emily']

In [387]:
selected_dfm.to_csv("../male_names_only_USA.csv", index=False)
selected_dff.to_csv("../female_names_only_USA.csv", index=False)

## 2. Get Unique Name by Country

This data is used to obtain 2 csv files:
* **a list of unique male names that is unique for each country**, saved as `../unique_male_names_and_country.csv` : a list of male names such that (1) for each male name it doesn't exist as a female name in any country and (2) for each male name, it's unique for each country
* **a list of unique female names that is unique for each country**, saved as `../unique_female_names_and_country.csv` : a list of female names such that (1) for each female name, it doesn't exist as a male name in any country  and (2) for each female name, it's unique for each country

In [388]:
name_to_country = {}
for country in gc.nameLists.keys():
    for gender, names in gc.nameLists[country].items():
        for name in names:
            if name in name_to_country and  name_to_country[name] != country:
                name_to_country[name] = 'invalid'
            else:
                name_to_country[name] = country
                
result = [(name, country) for name, country in name_to_country.items() if country != 'invalid']

In [389]:
df = pd.DataFrame(data=result, columns=["name", "country"])

In [390]:
df

             name          country
0      arsalakhan      Afghanistan
1           aymal      Afghanistan
2         babrack      Afghanistan
3        jelander      Afghanistan
4        kawatara      Afghanistan
...           ...              ...
90041        ypje  The Netherlands
90042        ytje  The Netherlands
90043       ytske  The Netherlands
90044       yttje  The Netherlands
90045      zuster  The Netherlands

[90046 rows x 2 columns]

In [391]:
df.to_csv("../unique_name_country.csv", index=None)

In [392]:
df = pd.read_csv("../unique_name_country.csv")

# gcm = pd.read_csv("../../data/gc_name/male_names_only.csv")
gcm = pd.read_csv("../male_names_only.csv")
gcm = gcm.sample(frac=1, random_state=123)
mnames = gcm["name"].tolist()# # names from GC
# gcf = pd.read_csv("../../data/gc_name/female_names_only.csv")
gcf = pd.read_csv("../female_names_only.csv")
gcf = gcf.sample(frac=1, random_state=123)
fnames = gcf["name"].tolist()# # names from GC


df = df.sample(frac=1, random_state=12345)
n = 1
gb = df.groupby("country")
unique_male_names = []
unique_female_names = []
countries = []
for k in gb.groups.keys() :
    d = gb.get_group(k)
    male = ""
    female = ""
#     print(len(d["name"].tolist()))
#     print(d["name"].tolist()[0])
    for name in d["name"].tolist():
#         if "-" not in name and " " not in name and "\\" not in name:
        if male == "" :
            if name in mnames :
                male = name
        if female == "" :
            if name in fnames :
                female = name
        if male != "" and female != "" :
            unique_male_names.append(male.title())
            unique_female_names.append(female.title())
            countries.append(k)
            break

In [393]:
print(unique_male_names)

['Jelander', 'Christop', 'Fabijano', 'Odisseu', 'Kerigan', 'Kajinek', 'Kauko', 'Kotsos', 'Lenci', 'Jivavijaya', 'Keyghobad', 'Airiz', 'Tsahi', 'Verners', 'Karstein', 'Albercik', 'Oliviu', 'Matevz', 'Waabberi', 'Vide', 'Harrit', 'Pars', 'Theoden', 'Eldridge', 'Budivid']

In [394]:
df_unique_male_names = pd.DataFrame(data={"name": unique_male_names, "country": countries})
df_unique_male_names.to_csv("../unique_male_names_and_country.csv")
df_unique_male_names

          name          country
0     Jelander      Afghanistan
1     Christop        Australia
2     Fabijano          Belgium
3      Odisseu           Brazil
4      Kerigan           Canada
5      Kajinek            Czech
6        Kauko          Finland
7       Kotsos           Greece
8        Lenci          Hungary
9   Jivavijaya            India
10   Keyghobad             Iran
11       Airiz          Ireland
12       Tsahi           Israel
13     Verners           Latvia
14    Karstein           Norway
15    Albercik           Poland
16      Oliviu          Romania
17      Matevz         Slovenia
18    Waabberi          Somalia
19        Vide           Sweden
20      Harrit  The Netherlands
21        Pars           Turkey
22     Theoden               UK
23    Eldridge              USA
24     Budivid          Ukraine

In [395]:
df_unique_female_names = pd.DataFrame(data={"name": unique_female_names, "country": countries})
df_unique_female_names.to_csv("../unique_female_names_and_country.csv")
df_unique_female_names

         name          country
0     Spogmai      Afghanistan
1    Kimberle        Australia
2      Manyak          Belgium
3    Ibiacema           Brazil
4      Toniko           Canada
5    Dagmarka            Czech
6   Josefiina          Finland
7       Pitsa           Greece
8        Bske          Hungary
9     Humaila            India
10     Avizeh             Iran
11    Jodilee          Ireland
12     Narkis           Israel
13       Sapa           Latvia
14  Hildegunn           Norway
15    Aneczka           Poland
16   Mariutza          Romania
17    Polonca         Slovenia
18     Cambro          Somalia
19    Felizia           Sweden
20   Waltruda  The Netherlands
21   Aybirgen           Turkey
22    Shontae               UK
23   Lizzette              USA
24   Bilomira          Ukraine